Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFK100.atdf
      <value-group caption="Analog Common Scan Select bits 35" name="ADCCSS2__CSS35">
         <value caption="Select ANx for input scan" name="" value="0x1"/>
         <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 36" name="ADCCSS2__CSS36">
         <value caption="Select ANx for input scan" name="" value="0x1"/>
         <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 37" name="ADCCSS2__CSS37">
         <value caption="Select ANx for input scan" name="" value="0x1"/>
         <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 38" name="ADCCSS2__CSS38">
         <value caption="Select ANx for input scan" name="" value="0x1"/>
         <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 39" name="ADCCSS2__CSS39">
         <value caption="Select ANx for input scan" name="" value="0x1"/>
         <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 40" name="ADCCSS2__CSS40">
         <value caption="Select ANx for input scan" name="" value="0x1"/>
         <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 41" name="ADCCSS2__CSS41">
         <value caption="Select ANx for input scan" name="" value="0x1"/>
         <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 42" name="ADCCSS2__CSS42">
         <value caption="Select ANx for input scan" name="" value="0x1"/>
         <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 43" name="ADCCSS2__CSS43">
         <value caption="Select ANx for input scan" name="" value="0x1"/>
         <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 44" name="ADCCSS2__CSS44">
         <value caption="Select ANx for input scan" name="" value="0x1"/>
         <value caption="Skip ANx for input scan" name="" value="0x0"/>
         <value caption="Select ANx for input scan" name="" value="0x1"/>
         <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 0" name="ADCDSTAT1__ARDY0">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 1" name="ADCDSTAT1__ARDY1">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 2" name="ADCDSTAT1__ARDY2">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 3" name="ADCDSTAT1__ARDY3">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 4" name="ADCDSTAT1__ARDY4">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 5" name="ADCDSTAT1__ARDY5">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 6" name="ADCDSTAT1__ARDY6">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 7" name="ADCDSTAT1__ARDY7">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 8" name="ADCDSTAT1__ARDY8">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 9" name="ADCDSTAT1__ARDY9">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
