Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFK100.atdf
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 10" name="ADCDSTAT1__ARDY10">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 11" name="ADCDSTAT1__ARDY11">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 12" name="ADCDSTAT1__ARDY12">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 13" name="ADCDSTAT1__ARDY13">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 14" name="ADCDSTAT1__ARDY14">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 15" name="ADCDSTAT1__ARDY15">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 16" name="ADCDSTAT1__ARDY16">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 17" name="ADCDSTAT1__ARDY17">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 18" name="ADCDSTAT1__ARDY18">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 19" name="ADCDSTAT1__ARDY19">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 20" name="ADCDSTAT1__ARDY20">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 21" name="ADCDSTAT1__ARDY21">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 22" name="ADCDSTAT1__ARDY22">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 23" name="ADCDSTAT1__ARDY23">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 24" name="ADCDSTAT1__ARDY24">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 25" name="ADCDSTAT1__ARDY25">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 26" name="ADCDSTAT1__ARDY26">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
