Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFK100.atdf
         <register caption="CAN Filter Control Register 6" name="C2FLTCON6" offset="0x1120" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL24" values="C2FLTCON6__FSEL24"/>
            <bitfield caption="Filter 24 Mask Select bits" mask="0x00000060" name="MSEL24" values="C2FLTCON6__MSEL24"/>
            <bitfield caption="Filter 24 Enable bit" mask="0x00000080" name="FLTEN24" values="C2FLTCON6__FLTEN24"/>
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL25" values="C2FLTCON6__FSEL25"/>
            <bitfield caption="Filter 25 Mask Select bits" mask="0x00006000" name="MSEL25" values="C2FLTCON6__MSEL25"/>
            <bitfield caption="Filter 25 Enable bit" mask="0x00008000" name="FLTEN25" values="C2FLTCON6__FLTEN25"/>
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL26" values="C2FLTCON6__FSEL26"/>
            <bitfield caption="Filter 26 Mask Select bits" mask="0x00600000" name="MSEL26" values="C2FLTCON6__MSEL26"/>
            <bitfield caption="Filter 26 Enable bit" mask="0x00800000" name="FLTEN26" values="C2FLTCON6__FLTEN26"/>
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL27" values="C2FLTCON6__FSEL27"/>
            <bitfield caption="Filter 27 Mask Select bits" mask="0x60000000" name="MSEL27" values="C2FLTCON6__MSEL27"/>
            <bitfield caption="Filter 27 Enable bit" mask="0x80000000" name="FLTEN27" values="C2FLTCON6__FLTEN27"/>
         </register>
         <register caption="CAN Filter Control Register 7" name="C1FLTCON7" offset="0x130" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL28" values="C1FLTCON7__FSEL28"/>
            <bitfield caption="Filter 28 Mask Select bits" mask="0x00000060" name="MSEL28" values="C1FLTCON7__MSEL28"/>
            <bitfield caption="Filter 28 Enable bit" mask="0x00000080" name="FLTEN28" values="C1FLTCON7__FLTEN28"/>
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL29" values="C1FLTCON7__FSEL29"/>
            <bitfield caption="Filter 29 Mask Select bits" mask="0x00006000" name="MSEL29" values="C1FLTCON7__MSEL29"/>
            <bitfield caption="Filter 29 Enable bit" mask="0x00008000" name="FLTEN29" values="C1FLTCON7__FLTEN29"/>
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL30" values="C1FLTCON7__FSEL30"/>
            <bitfield caption="Filter 30Mask Select bits" mask="0x00600000" name="MSEL30" values="C1FLTCON7__MSEL30"/>
            <bitfield caption="Filter 30Enable bit" mask="0x00800000" name="FLTEN30" values="C1FLTCON7__FLTEN30"/>
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL31" values="C1FLTCON7__FSEL31"/>
            <bitfield caption="Filter 31 Mask Select bits" mask="0x60000000" name="MSEL31" values="C1FLTCON7__MSEL31"/>
            <bitfield caption="Filter 31 Enable bit" mask="0x80000000" name="FLTEN31" values="C1FLTCON7__FLTEN31"/>
         </register>
         <register caption="CAN Filter Control Register 7" name="C2FLTCON7" offset="0x1130" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL28" values="C2FLTCON7__FSEL28"/>
            <bitfield caption="Filter 28 Mask Select bits" mask="0x00000060" name="MSEL28" values="C2FLTCON7__MSEL28"/>
            <bitfield caption="Filter 28 Enable bit" mask="0x00000080" name="FLTEN28" values="C2FLTCON7__FLTEN28"/>
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL29" values="C2FLTCON7__FSEL29"/>
            <bitfield caption="Filter 29 Mask Select bits" mask="0x00006000" name="MSEL29" values="C2FLTCON7__MSEL29"/>
            <bitfield caption="Filter 29 Enable bit" mask="0x00008000" name="FLTEN29" values="C2FLTCON7__FLTEN29"/>
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL30" values="C2FLTCON7__FSEL30"/>
            <bitfield caption="Filter 30Mask Select bits" mask="0x00600000" name="MSEL30" values="C2FLTCON7__MSEL30"/>
            <bitfield caption="Filter 30Enable bit" mask="0x00800000" name="FLTEN30" values="C2FLTCON7__FLTEN30"/>
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL31" values="C2FLTCON7__FSEL31"/>
            <bitfield caption="Filter 31 Mask Select bits" mask="0x60000000" name="MSEL31" values="C2FLTCON7__MSEL31"/>
            <bitfield caption="Filter 31 Enable bit" mask="0x80000000" name="FLTEN31" values="C2FLTCON7__FLTEN31"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF0" offset="0x140" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF0__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF0__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF0__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF0" offset="0x1140" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF0__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF0__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF0__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF1" offset="0x150" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF1__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF1__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF1__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF1" offset="0x1150" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF1__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF1__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF1__SID"/>
         </register>
