Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFK100.atdf
         <register caption="CAN Acceptance Filter " name="C1RXF17" offset="0x250" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF17__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF17__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF17__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF17" offset="0x1250" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF17__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF17__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF17__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF18" offset="0x260" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF18__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF18__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF18__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF18" offset="0x1260" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF18__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF18__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF18__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF19" offset="0x270" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF19__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF19__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF19__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF19" offset="0x1270" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF19__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF19__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF19__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF20" offset="0x280" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF20__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF20__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF20__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF20" offset="0x1280" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF20__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF20__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF20__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF21" offset="0x290" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF21__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF21__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF21__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF21" offset="0x1290" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF21__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF21__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF21__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF22" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF22__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF22__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF22__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF22" offset="0x12a0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF22__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF22__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF22__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF23" offset="0x2b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF23__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF23__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF23__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF23" offset="0x12b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF23__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF23__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF23__SID"/>
         </register>
