Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFK100.atdf
         <register caption="Output Compare 'x' Control Register" name="OC2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC2CON__OCM"/>
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC2CON__OCTSEL"/>
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC2CON__OCFLT"/>
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC2CON__OC32"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC2CON__SIDL"/>
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC2CON__ON"/>
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC3CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC3CON__OCM"/>
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC3CON__OCTSEL"/>
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC3CON__OCFLT"/>
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC3CON__OC32"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC3CON__SIDL"/>
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC3CON__ON"/>
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC4CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC4CON__OCM"/>
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC4CON__OCTSEL"/>
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC4CON__OCFLT"/>
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC4CON__OC32"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC4CON__SIDL"/>
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC4CON__ON"/>
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC5CON" offset="0x800" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC5CON__OCM"/>
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC5CON__OCTSEL"/>
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC5CON__OCFLT"/>
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC5CON__OC32"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC5CON__SIDL"/>
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC5CON__ON"/>
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC6CON" offset="0xa00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC6CON__OCM"/>
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC6CON__OCTSEL"/>
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC6CON__OCFLT"/>
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC6CON__OC32"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC6CON__SIDL"/>
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC6CON__ON"/>
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC7CON" offset="0xc00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC7CON__OCM"/>
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC7CON__OCTSEL"/>
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC7CON__OCFLT"/>
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC7CON__OC32"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC7CON__SIDL"/>
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC7CON__ON"/>
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC8CON" offset="0xe00" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC8CON__OCM"/>
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC8CON__OCTSEL"/>
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC8CON__OCFLT"/>
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC8CON__OC32"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC8CON__SIDL"/>
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC8CON__ON"/>
         </register>
         <register caption="Output Compare 'x' Control Register" name="OC9CON" offset="0x1000" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC9CON__OCM"/>
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC9CON__OCTSEL"/>
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC9CON__OCFLT"/>
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC9CON__OC32"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC9CON__SIDL"/>
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC9CON__ON"/>
         </register>
