Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFK100.atdf
         <register caption="Alarm Date Value Register" name="ALRMDATE" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="WDAY01"/>
            <bitfield mask="0x00000F00" name="DAY01"/>
            <bitfield mask="0x0000F000" name="DAY10"/>
            <bitfield mask="0x000F0000" name="MONTH01"/>
            <bitfield mask="0x00F00000" name="MONTH10"/>
         </register>
      </register-group>
      <value-group caption="RTCC Output Enable bit" name="RTCCON__RTCOE">
         <value caption="RTCC output is enabled" name="" value="0x1"/>
         <value caption="RTCC output is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Half-Second Status bit" name="RTCCON__HALFSEC">
         <value caption="Second half period of a second" name="" value="0x1"/>
         <value caption="First half period of a second" name="" value="0x0"/>
      </value-group>
      <value-group caption="Real-Time Clock Value Registers Read Synchronization bit" name="RTCCON__RTCSYNC">
         <value caption="Real-time clock value registers can change while reading (due to a rollover ripple that results in an invalid data read). If the register is read twice and results in the same data" name="" value="0x1"/>
         <value caption="Real-time clock value registers can be read without concern about a rollover ripple" name="" value="0x0"/>
      </value-group>
      <value-group caption="Real-Time Clock Value Registers Write Enable bit" name="RTCCON__RTCWREN">
         <value caption="Real-Time Clock Value registers can be written to by the user" name="" value="0x1"/>
         <value caption="Real-Time Clock Value registers are locked out from being written to by the user" name="" value="0x0"/>
      </value-group>
      <value-group caption="RTCC Clock Enable Status bit" name="RTCCON__RTCCLKON">
         <value caption="RTCC Clock is actively running" name="" value="0x1"/>
         <value caption="RTCC Clock is not running" name="" value="0x0"/>
      </value-group>
      <value-group caption="RTCC Output Data Select bits" name="RTCCON__RTCOUTSEL">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="RTCC Clock is presented on the RTCC pin" name="" value="0x2"/>
         <value caption="Seconds Clock is presented on the RTCC pin" name="" value="0x1"/>
         <value caption="Alarm Pulse is presented on the RTCC pin when the alarm interrupt is triggered" name="" value="0x0"/>
      </value-group>
      <value-group caption="RTCC Clock Select bits" name="RTCCON__RTCCLKSEL">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Reserved" name="" value="0x2"/>
         <value caption="RTCC uses the external 32.768 kHz Secondary Oscillator (SOSC)" name="" value="0x1"/>
         <value caption="RTCC uses the internal 32 kHz oscillator (LPRC)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="RTCCON__SIDL">
         <value caption="Disables RTCC operation when CPU enters Idle mode" name="" value="0x1"/>
         <value caption="Continue normal operation when CPU enters Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="RTCC On bit" name="RTCCON__ON">
         <value caption="RTCC module is enabled" name="" value="0x1"/>
         <value caption="RTCC module is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Real-Time Clock Drift Calibration bits" name="RTCCON__CAL">
         <value caption="Maximum positive adjustment" name="" value="0x1ff"/>
         <value caption="Minimum positive adjustment" name="" value="0x1"/>
         <value caption="No adjustment" name="" value="0x0"/>
         <value caption="Minimum negative adjustment" name="" value="0x3ff"/>
         <value caption="Minimum negative adjustment" name="" value="0x200"/>
      </value-group>
      <value-group caption="Alarm Repeat Counter Value bits" name="RTCALRM__ARPT">
         <value caption="Alarm will trigger 256 times" name="" value="0xff"/>
         <value caption="Alarm will trigger 255 times" name="" value="0xfe"/>
         <value caption="Alarm will trigger two times" name="" value="0x1"/>
         <value caption="Alarm will trigger one time" name="" value="0x0"/>
      </value-group>
      <value-group caption="Alarm Mask Configuration bits" name="RTCALRM__AMASK">
         <value caption="Every half-second" name="" value="0x0"/>
         <value caption="Every second" name="" value="0x1"/>
         <value caption="Every 10 seconds" name="" value="0x2"/>
         <value caption="Every minute" name="" value="0x3"/>
         <value caption="Every 10 minutes" name="" value="0x4"/>
         <value caption="Every hour" name="" value="0x5"/>
         <value caption="Once a day" name="" value="0x6"/>
         <value caption="Once a week" name="" value="0x7"/>
         <value caption="Once a month" name="" value="0x8"/>
         <value caption="Once a year (except when configured for February 29" name="" value="0x9"/>
         <value caption="Reserved" name="" value="0xa"/>
         <value caption="Reserved" name="" value="0xb"/>
         <value caption="Reserved" name="" value="11xx"/>
      </value-group>
      <value-group caption="Alarm Sync bit" name="RTCALRM__ALRMSYNC">
         <value caption="ARPT and ALRMEN may change as a result of a half second rollover during a read. The ARPT must be read repeatedly until the same value is read twice. This must be done since multiple bits may be changing." name="" value="0x1"/>
         <value caption="ARPT and ALRMEN can be read without concerns of rollover because the prescaler is more than 32 real-time clocks away from a half-second rollover" name="" value="0x0"/>
      </value-group>
      <value-group caption="Alarm Pulse Initial Value bit" name="RTCALRM__PIV">
         <value caption="low initial value of the Alarm Pulse (When ALRMEN = 0)" name="" value="0x0"/>
         <value caption="high initial value of the Alarm Pulse (When ALRMEN = 0)" name="" value="0x1"/>
      </value-group>
      <value-group caption="Chime Enable bit" name="RTCALRM__CHIME">
         <value caption="Chime is enabled ARPT is allowed to rollover from 0x00 to 0xFF" name="" value="0x1"/>
         <value caption="Chime is disabled ARPT stops once it reaches 0x00" name="" value="0x0"/>
      </value-group>
      <value-group caption="Alarm Enable bit" name="RTCALRM__ALRMEN">
         <value caption="Alarm is enabled" name="" value="0x1"/>
         <value caption="Alarm is disabled" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="00136" name="SB" version="1">
      <register-group name="SB">
         <register caption="System Bus Status Flag Register" name="SBFLAG" offset="0x0" rw="R" size="4">
            <bitfield caption="Target 0 Permission Group Violation Status bits" mask="0x00000001" name="T0PGV" values="SBFLAG__T0PGV"/>
            <bitfield caption="Target 1Permission Group Violation Status bits" mask="0x00000002" name="T1PGV" values="SBFLAG__T1PGV"/>
            <bitfield caption="Target 2 Permission Group Violation Status bits" mask="0x00000004" name="T2PGV" values="SBFLAG__T2PGV"/>
            <bitfield caption="Target 3 Permission Group Violation Status bits" mask="0x00000008" name="T3PGV" values="SBFLAG__T3PGV"/>
            <bitfield caption="Target 4 Permission Group Violation Status bits" mask="0x00000010" name="T4PGV" values="SBFLAG__T4PGV"/>
            <bitfield caption="Target 5 Permission Group Violation Status bits" mask="0x00000020" name="T5PGV" values="SBFLAG__T5PGV"/>
            <bitfield caption="Target 6 Permission Group Violation Status bits" mask="0x00000040" name="T6PGV" values="SBFLAG__T6PGV"/>
            <bitfield caption="Target 7 Permission Group Violation Status bits" mask="0x00000080" name="T7PGV" values="SBFLAG__T7PGV"/>
            <bitfield caption="Target 8 Permission Group Violation Status bits" mask="0x00000100" name="T8PGV" values="SBFLAG__T8PGV"/>
            <bitfield caption="Target 9 Permission Group Violation Status bits" mask="0x00000200" name="T9PGV" values="SBFLAG__T9PGV"/>
            <bitfield caption="Target 10 Permission Group Violation Status bits" mask="0x00000400" name="T10PGV" values="SBFLAG__T10PGV"/>
            <bitfield caption="Target 11 Permission Group Violation Status bits" mask="0x00000800" name="T11PGV" values="SBFLAG__T11PGV"/>
            <bitfield caption="Target 12 Permission Group Violation Status bits" mask="0x00001000" name="T12PGV" values="SBFLAG__T12PGV"/>
            <bitfield caption="Target 13 Permission Group Violation Status bits" mask="0x00002000" name="T13PGV" values="SBFLAG__T13PGV"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT0ELOG1" offset="0x7b10" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT0ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT0ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT0ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT0ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT0ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT1ELOG1" offset="0x7f10" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT1ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT1ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT1ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT1ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT1ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT2ELOG1" offset="0x8310" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT2ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT2ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT2ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT2ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT2ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT3ELOG1" offset="0x8710" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT3ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT3ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT3ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT3ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT3ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT4ELOG1" offset="0x8b10" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT4ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT4ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT4ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT4ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT4ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT5ELOG1" offset="0x8f10" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT5ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT5ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT5ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT5ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT5ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT6ELOG1" offset="0x9310" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT6ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT6ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT6ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT6ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT6ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT7ELOG1" offset="0x9710" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT7ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT7ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT7ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT7ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT7ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT8ELOG1" offset="0x9b10" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT8ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT8ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT8ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT8ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT8ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT9ELOG1" offset="0x9f10" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT9ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT9ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT9ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT9ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT9ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT10ELOG1" offset="0xa310" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT10ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT10ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT10ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT10ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT10ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT11ELOG1" offset="0xa710" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT11ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT11ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT11ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT11ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT11ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT12ELOG1" offset="0xab10" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT12ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT12ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT12ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT12ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT12ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT13ELOG1" offset="0xaf10" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT13ELOG1__CMD"/>
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT13ELOG1__REGION"/>
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT13ELOG1__INITID"/>
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT13ELOG1__CODE"/>
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT13ELOG1__MULTI"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT0ELOG2" offset="0x7b14" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT0ELOG2__GROUP"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT1ELOG2" offset="0x7f14" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT1ELOG2__GROUP"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT2ELOG2" offset="0x8314" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT2ELOG2__GROUP"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT3ELOG2" offset="0x8714" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT3ELOG2__GROUP"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT4ELOG2" offset="0x8b14" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT4ELOG2__GROUP"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT5ELOG2" offset="0x8f14" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT5ELOG2__GROUP"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT6ELOG2" offset="0x9314" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT6ELOG2__GROUP"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT7ELOG2" offset="0x9714" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT7ELOG2__GROUP"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT8ELOG2" offset="0x9b14" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT8ELOG2__GROUP"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT9ELOG2" offset="0x9f14" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT9ELOG2__GROUP"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT10ELOG2" offset="0xa314" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT10ELOG2__GROUP"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT11ELOG2" offset="0xa714" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT11ELOG2__GROUP"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT12ELOG2" offset="0xab14" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT12ELOG2__GROUP"/>
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT13ELOG2" offset="0xaf14" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT13ELOG2__GROUP"/>
         </register>
