Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFK100.atdf
         <register caption="" name="SBT5REG0" offset="0x8f30" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT5REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT5REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT5REG1" offset="0x8f50" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT5REG1__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT5REG1__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT5REG2" offset="0x8f70" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT5REG2__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT5REG2__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT6REG0" offset="0x9330" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT6REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT6REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT6REG1" offset="0x9350" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT6REG1__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT6REG1__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT7REG0" offset="0x9730" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT7REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT7REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT7REG1" offset="0x9750" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT7REG1__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT7REG1__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT8REG0" offset="0x9b30" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT8REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT8REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT8REG1" offset="0x9b50" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT8REG1__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT8REG1__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT9REG0" offset="0x9f30" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT9REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT9REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT9REG1" offset="0x9f50" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT9REG1__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT9REG1__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT10REG0" offset="0xa330" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT10REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT10REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT11REG0" offset="0xa730" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT11REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT11REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT11REG1" offset="0xa750" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT11REG1__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT11REG1__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT12REG0" offset="0xab30" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT12REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT12REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT13REG0" offset="0xaf30" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT13REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT13REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT0RD0" offset="0x7b40" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT0RD0__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT0RD0__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT0RD0__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT0RD0__GROUP3"/>
         </register>
         <register caption="" name="SBT0RD1" offset="0x7b60" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT0RD1__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT0RD1__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT0RD1__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT0RD1__GROUP3"/>
         </register>
         <register caption="" name="SBT1RD0" offset="0x7f40" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD0__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD0__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD0__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD0__GROUP3"/>
         </register>
         <register caption="" name="SBT1RD2" offset="0x7f80" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD2__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD2__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD2__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD2__GROUP3"/>
         </register>
         <register caption="" name="SBT1RD3" offset="0x7fa0" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD3__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD3__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD3__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD3__GROUP3"/>
         </register>
         <register caption="" name="SBT1RD4" offset="0x7fc0" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD4__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD4__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD4__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD4__GROUP3"/>
         </register>
         <register caption="" name="SBT1RD5" offset="0x7fe0" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD5__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD5__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD5__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD5__GROUP3"/>
         </register>
         <register caption="" name="SBT1RD6" offset="0x8000" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD6__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD6__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD6__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD6__GROUP3"/>
         </register>
         <register caption="" name="SBT1RD7" offset="0x8020" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD7__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD7__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD7__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD7__GROUP3"/>
         </register>
         <register caption="" name="SBT1RD8" offset="0x8040" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD8__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD8__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD8__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD8__GROUP3"/>
         </register>
         <register caption="" name="SBT2RD0" offset="0x8340" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2RD0__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2RD0__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2RD0__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2RD0__GROUP3"/>
         </register>
         <register caption="" name="SBT2RD1" offset="0x8360" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2RD1__GROUP0"/>
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2RD1__GROUP1"/>
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2RD1__GROUP2"/>
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2RD1__GROUP3"/>
         </register>
