Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFK100.atdf
      <value-group caption="Requested Permissions Group bits" name="SBT6ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3"/>
         <value caption="Group 2" name="" value="0x2"/>
         <value caption="Group 1" name="" value="0x1"/>
         <value caption="Group 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT7ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3"/>
         <value caption="Group 2" name="" value="0x2"/>
         <value caption="Group 1" name="" value="0x1"/>
         <value caption="Group 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT8ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3"/>
         <value caption="Group 2" name="" value="0x2"/>
         <value caption="Group 1" name="" value="0x1"/>
         <value caption="Group 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT9ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3"/>
         <value caption="Group 2" name="" value="0x2"/>
         <value caption="Group 1" name="" value="0x1"/>
         <value caption="Group 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT10ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3"/>
         <value caption="Group 2" name="" value="0x2"/>
         <value caption="Group 1" name="" value="0x1"/>
         <value caption="Group 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT11ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3"/>
         <value caption="Group 2" name="" value="0x2"/>
         <value caption="Group 1" name="" value="0x1"/>
         <value caption="Group 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT12ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3"/>
         <value caption="Group 2" name="" value="0x2"/>
         <value caption="Group 1" name="" value="0x1"/>
         <value caption="Group 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT13ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3"/>
         <value caption="Group 2" name="" value="0x2"/>
         <value caption="Group 1" name="" value="0x1"/>
         <value caption="Group 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT0ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT1ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT2ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT3ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT4ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT5ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT6ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT7ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT8ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT9ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT10ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT11ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT12ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Control bit" name="SBT13ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1"/>
         <value caption="Do not report protection group violation errors" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT0REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
